In [1]:
import pandas as pd

In [2]:
friends = [
    {'age': 15, 'job': 'student'},
    {'age': 25, 'job': 'developer'},
    {'age': 30, 'job': 'teacher'}
]

In [3]:
df = pd.DataFrame(friends,
                  index = ['John', 'Jenny', 'Nate'],
                  columns = ['age', 'job']
                 )

In [4]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

## Drop row

### by index name

In [5]:
df.drop(['John', 'Nate'])

       age        job
Jenny   25  developer

#### inplace
- drop 한 value가 Dataframe에 적용
- 따로 Assign하지 않아도 된다.

In [6]:
df.drop(['John', 'Nate'], inplace = True)

In [7]:
df

       age        job
Jenny   25  developer

### by index

In [12]:
friends = [
    {'name': 'John', 'age': 15, 'job': 'student'},
    {'name': 'Jenny', 'age': 25, 'job': 'developer'},
    {'name': 'Nate', 'age': 30, 'job': 'teacher'}
]

df = pd.DataFrame(friends,
                  columns = ['name', 'age', 'job']
                 )

In [13]:
df

    name  age        job
0   John   15    student
1  Jenny   25  developer
2   Nate   30    teacher

In [14]:
df.drop(df.index[[0, 2]])

    name  age        job
1  Jenny   25  developer

#### df.index에 대한 생각 및 실습

In [43]:
df.iloc

In [44]:
type(df.iloc)

pandas.core.indexing._iLocIndexer

In [46]:
list(df.iloc[0])

['John', 15, 'student']

In [31]:
df.iloc[0]

name       John
age          15
job     student
Name: 0, dtype: object

In [37]:
df.iloc[[0]]

   name  age      job
0  John   15  student

In [38]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [42]:
type(df.index)

pandas.core.indexes.range.RangeIndex

In [39]:
list(df.index)

[0, 1, 2]

In [41]:
list(df.index[[0, 2]])

[0, 2]

In [36]:
df.index[0]

0

In [33]:
df.iloc[df.index[0]]

name       John
age          15
job     student
Name: 0, dtype: object

In [35]:
df.index[[0]]

Int64Index([0], dtype='int64')

In [34]:
df.iloc[df.index[[0]]]

   name  age      job
0  John   15  student

### by column value

In [50]:
friends = [
    {'name': 'John', 'age': 15, 'job': 'student'},
    {'name': 'Jenny', 'age': 25, 'job': 'developer'},
    {'name': 'Nate', 'age': 30, 'job': 'teacher'}
]

df = pd.DataFrame(friends,
                  columns = ['name', 'age', 'job']
                 )

In [51]:
df

    name  age        job
0   John   15    student
1  Jenny   25  developer
2   Nate   30    teacher

In [52]:
df[df.age > 20]

    name  age        job
1  Jenny   25  developer
2   Nate   30    teacher

## Drop column

In [56]:
friends = [
    {'name': 'John', 'age': 15, 'job': 'student'},
    {'name': 'Jenny', 'age': 25, 'job': 'developer'},
    {'name': 'Nate', 'age': 30, 'job': 'teacher'}
]

df = pd.DataFrame(friends,
                  columns = ['name', 'age', 'job']
                 )

In [57]:
df

    name  age        job
0   John   15    student
1  Jenny   25  developer
2   Nate   30    teacher

In [58]:
df.drop('age', axis= 1)

    name        job
0   John    student
1  Jenny  developer
2   Nate    teacher

In [59]:
df.drop('age', axis= 1, inplace= True)

In [60]:
df

    name        job
0   John    student
1  Jenny  developer
2   Nate    teacher